tutorials/viscoelasticFluidFoam/Feta-PTT/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    fixedWalls
    {
        type            wall;
        nFaces          10800;
        startFace       316800;
    }
    inlet
    {
        type            patch;
        nFaces          1800;
        startFace       327600;
    }
    outlet
    {
        type            patch;
        nFaces          1800;
        startFace       329400;
    }
)

// ************************************************************************* //
